IRP/src/DataProcessors/StoreKeeperWorkspace/StoreKeeperWorkspace.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
 <name>StoreKeeperWorkspace</name>
</mdclass:DataProcessor>

IRP/src/AccumulationRegisters/R4031B_GoodsInTransitIncoming/R4031B_GoodsInTransitIncoming.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R4031B_GoodsInTransitIncoming</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Basis</name>
  <type>
   <types>DefinedType.typeReceiptBasis</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/GoodsReceiptTransactionTypes/GoodsReceiptTransactionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>GoodsReceiptTransactionTypes</name>
 <enumValues>
  <name>InventoryTransfer</name>
 </enumValues>
 <enumValues>
  <name>Purchase</name>
 </enumValues>
 <enumValues>
  <name>ReturnFromCustomer</name>
 </enumValues>
 <enumValues>
  <name>ReceiptFromConsignor</name>
 </enumValues>
 <enumValues>
  <name>ReturnFromTradeAgent</name>
 </enumValues>
 <enumValues>
  <name>PreliminaryStock</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/GoodsReceipt/GoodsReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>GoodsReceipt</name>
 <registerRecords>AccumulationRegister.TM1010B_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R4010B_ActualStocks</registerRecords>
 <registerRecords>InformationRegister.T3010S_RowIDInfo</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_RowIDSerialLotNumbers</registerRecords>
 <registerRecords>AccumulationRegister.R4017B_InternalSupplyRequestProcurement</registerRecords>
 <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
 <registerRecords>AccumulationRegister.R1031B_ReceiptInvoicing</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R4035B_IncomingStocks</registerRecords>
 <registerRecords>AccumulationRegister.R4012B_StockReservation</registerRecords>
 <registerRecords>AccumulationRegister.R4031B_GoodsInTransitIncoming</registerRecords>
 <registerRecords>AccumulationRegister.R2013T_SalesOrdersProcurement</registerRecords>
 <registerRecords>AccumulationRegister.R4033B_GoodsReceiptSchedule</registerRecords>
 <registerRecords>AccumulationRegister.R4036B_IncomingStocksRequested</registerRecords>
 <registerRecords>AccumulationRegister.R4014B_SerialLotNumber</registerRecords>
 <registerRecords>AccumulationRegister.R4021B_StockTransferOrdersReceipt</registerRecords>
 <registerRecords>AccumulationRegister.R2031B_ShipmentInvoicing</registerRecords>
 <registerRecords>AccumulationRegister.R1011B_PurchaseOrdersReceipt</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>TransactionType</name>
  <type>
   <types>EnumRef.GoodsReceiptTransactionTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>ReceiptBasis</name>
   <type>
    <types>DefinedType.typeReceiptBasis</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesOrder</name>
   <type>
    <types>DocumentRef.SalesOrder</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>PurchaseInvoice</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>PurchaseOrder</name>
   <type>
    <types>DocumentRef.PurchaseOrder</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalSupplyRequest</name>
   <type>
    <types>DocumentRef.InternalSupplyRequest</types>
   </type>
  </attributes>
  <attributes>
   <name>InventoryTransferOrder</name>
   <type>
    <types>DocumentRef.InventoryTransferOrder</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesReturn</name>
   <type>
    <types>DocumentRef.SalesReturn</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesReturnOrder</name>
   <type>
    <types>DocumentRef.SalesReturnOrder</types>
   </type>
  </attributes>
  <attributes>
   <name>InventoryTransfer</name>
   <type>
    <types>DocumentRef.InventoryTransfer</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesInvoice</name>
   <type>
    <types>DocumentRef.SalesInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>UseSerialLotNumber</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ProductionPlanning</name>
   <type>
    <types>DocumentRef.ProductionPlanning</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RowIDInfo</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Basis</name>
   <type>
    <types>DocumentRef</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrentStep</name>
   <type>
    <types>CatalogRef.MovementRules</types>
   </type>
  </attributes>
  <attributes>
   <name>NextStep</name>
   <type>
    <types>CatalogRef.MovementRules</types>
   </type>
  </attributes>
  <attributes>
   <name>RowRef</name>
   <type>
    <types>CatalogRef.RowIDs</types>
   </type>
  </attributes>
  <attributes>
   <name>BasisKey</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SerialLotNumbers</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Companies</name>
  <predefined>
    <items>
      <name>Default</name>
    </items>
  </predefined>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.Countries</types>
    </type>
  </attributes>
  <attributes>
    <name>MainCompany</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.CompanyLegalType</types>
    </type>
  </attributes>
  <attributes>
    <name>OurCompany</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LandedCostCurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </attributes>
  <attributes>
    <name>LandedCostExpenseType</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>LandedCostFillEmptyAmount</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LandedCostPriceTypeForEmptyAmount</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>TradeAgentStore</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MainPhoneNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SalaryAccrualVacation</name>
    <type>
      <types>CatalogRef.AccrualAndDeductionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>SalaryMaxDaysVacation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SalaryAccrualSickLeave</name>
    <type>
      <types>CatalogRef.AccrualAndDeductionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>SalaryMaxDaysSickLeave</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SalaryBasicPayroll</name>
    <type>
      <types>CatalogRef.AccrualAndDeductionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PrintInfo</name>
    <type>
      <types>CatalogRef.PrintInfo</types>
    </type>
  </attributes>
  <attributes>
    <name>MainLegalAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Units/Units.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Units</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>Quantity</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>15</precision>
    <scale>5</scale>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>BasisUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>UOM</name>
  <type>
   <types>CatalogRef.UnitsOfMeasurement</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/DataProcessors/StoreKeeperWorkspace/Forms/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	EnableButtons();
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "NewBarcode" And IsInputAvailable() Then
		SearchByBarcode(Undefined, Parameter);
	EndIf;
EndProcedure

&AtClient
Procedure GoodsInTransitIncomingRefreshRequestProcessing(Item)
	GoodsInTransitIncomingRefreshRequestProcessingAtServer();
EndProcedure

&AtClient
Procedure SearchByBarcode(Command, Barcode = "")
	DocumentsClient.SearchByBarcode(Barcode, Object, ThisObject, ThisObject);
EndProcedure

&AtClient
Async Procedure InputBarcode(Command)
	Barcode = "";
	Barcode = Await InputStringAsync(Barcode);
	SearchByBarcode(Undefined, Barcode);
EndProcedure

&AtServer
Procedure GoodsInTransitIncomingRefreshRequestProcessingAtServer()
		
	If ItemKey.IsEmpty() Then
		GoodsInTransitIncoming.Clear();
		Return;
	EndIf;
	
	Query = New Query();
	Query.Text = 
	"SELECT DISTINCT
	|	Incoming.Basis.Company AS Company,
	|	Incoming.Basis.Branch AS Branch,
	|	ISNULL(Incoming.Basis.Partner, VALUE(Catalog.Partners.EmptyRef)) AS Partner,
	|	ISNULL(Incoming.Basis.LegalName, VALUE(Catalog.Companies.EmptyRef)) AS LegalName
	|FROM
	|	AccumulationRegister.R4031B_GoodsInTransitIncoming.Balance(, ItemKey = &ItemKey
	|	AND CASE
	|		WHEN &Filter_Store
	|			THEN Store = &Store
	|		ELSE TRUE
	|	END) AS Incoming
	|WHERE
	|	Incoming.QuantityBalance > 0";
	
	Query.SetParameter("ItemKey", ThisObject.ItemKey);
	Query.SetParameter("Filter_Store", ValueIsFilled(ThisObject.Store));
	Query.SetParameter("Store", ThisObject.Store);
	
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	
	GR_EmptyRef = Documents.GoodsReceipt.EmptyRef();
	
	ThisObject.GoodsInTransitIncoming.Clear();
	BasisTableTotal = ThisObject.GoodsInTransitIncoming.Unload().CopyColumns();
	
	While QuerySelection.Next() Do
		BasisDocData = New Structure();
		BasisDocData.Insert("Company"   , QuerySelection.Company);
		BasisDocData.Insert("Branch"    , QuerySelection.Branch);
		BasisDocData.Insert("Partner"   , QuerySelection.Partner);
		BasisDocData.Insert("LegalName" , QuerySelection.LegalName);
		BasisDocData.Insert("Ref"       , GR_EmptyRef);
		BasisDocData.Insert("TransactionType" , Enums.GoodsReceiptTransactionTypes.InventoryTransfer);

		Filter = RowIDInfoClientServer.GetLinkedDocumentsFilter_GR(BasisDocData);
		
		Filter.Insert("ItemKey", ThisObject.ItemKey);
		If ValueIsFilled(ThisObject.Store) Then
			Filter.Insert("Store", ThisObject.Store);
		EndIf;
		
		BasisesTable = RowIDInfoPrivileged.GetBasises(GR_EmptyRef, Filter);
		For Each Row In BasisesTable Do
			NewRow = BasisTableTotal.Add();
			FillPropertyValues(NewRow, Row);
			BasisesInfo = RowIDInfoServer.GetBasisesInfo(Row.Basis, Row.BasisKey, Row.RowID);
			NewRow.Unit = BasisesInfo.Unit;
			NewRow.Quantity = Catalogs.Units.Convert(NewRow.BasisUnit, NewRow.Unit, NewRow.QuantityInBaseUnit);
		EndDo;		
	EndDo;	
	
	ArrayOfColumns = New Array();
	For Each Column In BasisTableTotal.Columns Do
		ArrayOfColumns.Add(Column.Name);
	EndDo;
	BasisTableTotal.GroupBy(StrConcat(ArrayOfColumns, ","));
	ThisObject.GoodsInTransitIncoming.Load(BasisTableTotal);
	
	Items.PagesSettings.CurrentPage = Items.GroupGoodsReceipt;
	
	EnableButtons();
EndProcedure

&AtServer
Procedure Clear()
	GoodsInTransitIncoming.Clear();
	Item = Undefined;
	ItemKey = Undefined;
	Unit = Undefined;
	Quantity = 0;
	
	EnableButtons();
EndProcedure

&AtClient
Procedure QuantityOnChange()
	EnableButtons();
EndProcedure

&AtServer
Procedure EnableButtons()
	Items.ButtonGoodsReceipt.Enabled = Quantity;
EndProcedure

&AtClient
Async Procedure SearchByBarcodeEnd(Result, AdditionalParameters) Export

	If Not Result.FoundedItems.Count()
		And Result.Barcodes.Count() Then
		CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().S_019, Result.Barcodes[0]));
		Return;
	EndIf;

	NotifyParameters = New Structure();
	NotifyParameters.Insert("Form", ThisObject);
	NotifyParameters.Insert("Object", ThisObject);

	For Each Row In Result.FoundedItems Do
		Item = Row.Item;
		ItemKey = Row.ItemKey;
		Unit = Row.Unit;
		
		GoodsInTransitIncomingRefreshRequestProcessingAtServer();
		
		ThisObject.CurrentItem = Items.Quantity;
#If MobileClient Then
		BeginEditingItem();
#EndIf
	EndDo;

EndProcedure

&AtClient
Procedure ItemKeyOnChange(Item)
	GoodsInTransitIncomingRefreshRequestProcessingAtServer();
EndProcedure

&AtClient
Procedure CreateDocumentGoodsReceipt(Command)
	CurrentData = Items.GoodsInTransitIncoming.CurrentData;
	If CurrentData = Undefined Then
		CommonFunctionsClientServer.ShowUsersMessage(R().Error_101);
		Return;
	EndIf;
	
	ColumnNames = "
	|Basis,
	|BasisKey,
	|BasisUnit,
	|CurrentStep,	
	|Item,
	|ItemKey,
	|Key,
	|ParentBasis,
	|Quantity,
	|QuantityInBaseUnit,
	|RowID,
	|RowRef,
	|Store,
	|Unit";
	StructureRow = New Structure(ColumnNames);
	FillPropertyValues(StructureRow, CurrentData);
	
	CreateDocuments(StructureRow, True, False);
EndProcedure

&AtServer
Procedure CreateDocuments(Val StructureRow, CreateGoodsReceipt, CreateInventoryTransfer)

	BeginTransaction();
	Try
		CreationDate = CommonFunctionsServer.GetCurrentSessionDate();
		If CreateGoodsReceipt Then
			
			If ValueIsFilled(ThisObject.Unit) Then
				StructureRow.Unit = ThisObject.Unit;
				StructureRow.QuantityInBaseUnit =
				Catalogs.Units.Convert(StructureRow.Unit, StructureRow.BasisUnit, ThisObject.Quantity);
			Else
				StructureRow.QuantityInBaseUnit = ThisObject.Quantity;
			EndIf; 
			
			ResultTable = ThisObject.GoodsInTransitIncoming.Unload().CopyColumns();
			FillPropertyValues(ResultTable.Add(), StructureRow);
			
			GoodsReceipt = Documents.GoodsReceipt.CreateDocument();
			GoodsReceipt.Date = CreationDate + 1;
			
			Data = RowIDInfoPrivileged.ExtractData(ResultTable, GoodsReceipt.Ref);
			FillingValues = RowIDInfoPrivileged.ConvertDataToFillingValues(GoodsReceipt.Ref.Metadata(), Data);
			If Not FillingValues.Count() Then
				Raise "Converting Data to Filling values failed";
			EndIf;
			GoodsReceipt.Fill(FillingValues[0]);
			GoodsReceipt.Write(DocumentWriteMode.Posting);		
		EndIf;
		CommitTransaction();
	Except
		RollbackTransaction();
		CommonFunctionsClientServer.ShowUsersMessage(ErrorProcessing.DetailErrorDescription(ErrorInfo()));
	EndTry;
	Clear();

	If CreateGoodsReceipt Then
		ThisObject.DocGoodsReceipt = GoodsReceipt.Ref;
	EndIf;
	Items.PagesSettings.CurrentPage = Items.PageSettings;
EndProcedure
